# Find the first 50% records of the dataset


Find the first 50% records of the dataset.

In [1]:
import pandas as pd
import numpy as np
q=pd.read_csv('worker.csv')
q

   worker_id first_name last_name  salary    joining_date department
0          1     Monika     Arora  100000  2/20/2014 9:00         HR
1          2   Niharika     Verma   80000  6/11/2014 9:00      Admin
2          3     Vishal   Singhal  300000  2/20/2014 9:00         HR
3          4     Amitah     Singh  500000  2/20/2014 9:00      Admin
4          5      Vivek     Bhati  500000  6/11/2014 9:00      Admin
5          6      Vipul     Diwan  200000  6/11/2014 9:00    Account
6          7     Satish     Kumar   75000  1/20/2014 9:00    Account
7          8    Geetika   Chauhan   90000  4/11/2014 9:00      Admin

In [2]:
# find the total rows of this dataset
len(q)

8

In [8]:
# find the first 50% records of the dataset
q[q.index<(len(q)/2)]

   worker_id first_name last_name  salary    joining_date department
0          1     Monika     Arora  100000  2/20/2014 9:00         HR
1          2   Niharika     Verma   80000  6/11/2014 9:00      Admin
2          3     Vishal   Singhal  300000  2/20/2014 9:00         HR
3          4     Amitah     Singh  500000  2/20/2014 9:00      Admin